#+TITLE: Spacemacs User Configuration File
#+STARTUP: hidestars
#+FILETAGS: spacemacs config

** Export to task juggler
   #+BEGIN_SRC emacs-lisp
     (require 'ox-taskjuggler)
     (setq org-taskjuggler-project-tag "tjp")
     (setq org-taskjuggler-reports-directory "~/org/reports")
   #+END_SRC

   #+RESULTS:
   : ~/org/reports

   Modify the default report to provide a more reasonable report.
   #+BEGIN_SRC emacs-lisp
   (setq org-taskjuggler-default-project-duration 980)
   (setq org-taskjuggler-default-reports
     '("textreport report \"Plan\" {
     formats html
     header '== <-query attribute=\"name\"-> =='

     center -8<-
       [#Plan Plan] | [#Resource_Allocation Resource Allocation]
       ----
       === Plan ===
       <[report id=\"plan\"]>
       ----
       === Resource Allocation ===
       <[report id=\"resourceGraph\"]>
     ->8-
   }

   # A traditional Gantt chart with a project overview.
   taskreport plan \"\" {
     headline \"Project Plan\"
     columns bsi, name, complete, start, end, effort, chart
   # rollup completed tasks
   #  rolluptask plan.end < ${now}
     loadunit shortauto
     hideresource 1
   }

   # A graph showing resource allocation. It identifies whether each
   # resource is under- or over-allocated for.
   resourcereport resourceGraph \"\" {
     headline \"Resource Allocation Graph\"
     columns no, name, effort, weekly
     loadunit shortauto
     hidetask ~(isleaf() & isleaf_())
     sorttasks plan.start.up
   }"))

   #+END_SRC

   #+RESULTS:
   | textreport report "Plan" { |

